{
  "basics": {
    "name": "Ilja Strobbe",
    "label": "Software Engineer",
    "picture": "https://www.robonaut.be/assets/images/cv_profile_picture.jpeg",
    "email": "ilja@robonaut.be",
    "phone": "+32485799803",
    "website": "https://cv.robonaut.be",
    "summary": "Software engineer with a background in theoretical physics who specializes in scalable software architecture, performant API’s and beautiful user interfaces. Out of the box thinker who is fluent in a number of programming languages and frameworks and comfortable with both frontend and backend development. Autodidact who learns quickly and is intrinsically motivated to get things done. Excellent communication skills, both verbal and written. Willing to take the initiative when working both individually and as part of a team. Passionate about space travel, big questions, creativity and the fabric of reality. Applies string theory to guitars and pianos.",
    "location": {
      "address": "Ciamberlanidreef 72/16",
      "postalCode": "9120",
      "city": "Beveren-Waas",
      "countryCode": "BE",
      "region": "Oost-Vlaanderen"
    },
    "profiles": [
      {
        "network": "github",
        "username": "robonaut",
        "url": "https://github.com/robonaut"
      },
      {
        "network": "twitter",
        "username": "istrobes",
        "url": "https://twitter.com/istrobes"
      },
      {
        "network": "linkedin",
        "username": "iljastrobbe",
        "url": "https://be.linkedin.com/in/iljastrobbe"
      }
    ]
  },
  "work": [
    {
      "company": "Sentiance",
      "position": "Senior Full Stack Engineer",
      "website": "https://www.sentiance.com",
      "startDate": "2018/04/10",
      "summary": "Sentiance is a data science company turning IOT sensor data into rich insights about people’s behavior and real-time context. These insights enable companies to understand how customers go through their everyday lives, discover and anticipate the moments that matter most, and adapt their engagement to real-world behavior and real-time context.",
      "highlights": [
        "To accomodate a newly conceived coaching platform, I wrote the graphQL API and the database design (PostgreSQL) and together with our team I integrated this API with other internal services (Apache Kafka). We also made a new flavor of the mobile app to showcase the added coaching capabilities.",
        "My first task upon arriving was a complete rewrite of the Sentiance demo app (Journeys) which embeds their proprietary tracking SDK. Therefore we bridged the native SDK's for android and iOS to React Native. We created a brand new app (React Native, Redux) and added animated interactive map views (Mapbox) together with custom animations and data visualisations, powered by a GraphQL API interface. I also created a CI/CD pipeline that automated distributing multiple flavors of their app (and sdk) enforcing 98% test coverage."
      ]
    },
    {
      "company": "Small Town Heroes",
      "position": "Full Stack Hero",
      "website": "https://www.smalltownheroes.be",
      "startDate": "2012/05/01",
      "endDate": "2018/04/10",
      "summary": "Small Town Heroes is a Ghent based startup that provides software tools and services for broadcaster and publishers with a focus on mobile video experiences and user interactions.",
      "highlights": [
        "I was responsible for the design and implementation of scalable backend services, high traffic websites, API's and CMS interfaces for a variety of (live) TV shows. I took care of the full release cycle of the services - from concept to production releases - with an eye for quality, detail and user experience. My area of expertise essentially covered their complete technology stack ranging from server deploys to UI tweaks. While continuously learning I gained expert knowledge of and hands-on experience with Amazon Web Services, Node.js and its ecosystem, serverless architectures, RESTful dockerized web services, NoSQL data stores and a plethora of frontend development frameworks like react and react-native."
      ]
    },
    {
      "company": "iMinds",
      "position": "R&D Engineer",
      "website": "https://www.iminds.be",
      "startDate": "2012/01/01",
      "endDate": "2012/04/30",
      "summary": "iMinds is Flanders’ digital research & entrepreneurship hub. We drive digital innovation for society and economy, through strategic and applied research on key digital technologies."
    },
    {
      "company": "VRT Medialab",
      "position": "R&D Engineer",
      "website": "https://innovatie.vrt.be",
      "startDate": "2009/01/01",
      "endDate": "2012/01/01",
      "summary": "VRT-medialab is the technological research department of VRT, Flanders’ public service broadcaster. VRT-medialab carries out research into the creation, management and distribution of media content. Its focus is on the Flemish media market, but VRT-medialab pursues collaboration on a European and worldwide level. ",
      "highlights": [
        "I was part of the development team that launched one of the first second-screen applications (Ruby, Redis, PostgreSQL) for a live TV show. In the hours before launching I fixed a critical performance issue.",
        "In my first year I wrote and presented an IEE publication for SMPTE (Society of Motion Picture & Television Engineers): \"Taking File-Based Workflows to the Next Level: Project and Timeline Based Integrations.\""
      ]
    },
    {
      "company": "Spector Photogroup",
      "position": "Application Logic Tests",
      "website": "https://www.smartphoto.be",
      "startDate": "2007/09/01",
      "endDate": "2008/12/31",
      "summary": "SmartPhoto is one of the leading providers of photo service in Europe; and is dedicated to making beautiful Photo products. Our intuitive web platform helps you share your pictures, and create stunning Photo products.",
      "highlights": [
        "As an application tester I reviewed the code and database queries and gained hands-on experience with an international commercial platform coded in .NET #C and MS SQL. I also developed an internal tool in C# for validating photo orders."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "UGent",
      "area": "Applied Information Technology",
      "studyType": "Master",
      "startDate": "2006/10/01",
      "endDate": "2007/08/31",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "UGent",
      "area": "Theoretical Physics",
      "studyType": "Master",
      "startDate": "2002/10/01",
      "endDate": "2006/06/30",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "IBC Innovation Award for Content Management",
      "date": "2016/09/01"
    },
    {
      "title": "IAB Mixx-award: Zapp Tekenapp",
      "date": "2014/02/01"
    }
  ],
  "publications": [
    {
      "name": "Taking File-Based Workflows to the Next Level: Project and Timeline Based Integrations",
      "publisher": "SMPTE",
      "releaseDate": "2009/10/27",
      "website": "https://ieeexplore.ieee.org/xpl/articleDetails.jsp?reload=true&arnumber=7269125&filter%3DAND(p_IS_Number%3A7269114)",
      "summary": "This paper explores state-of-the-art techniques for exchanging project and timeline information with and between major post production suites and pinpoints the present shortcomings and bottlenecks."
    }
  ],
  "skills": [
    {
      "name": "Software Development",
      "keywords": [
        "Microservices",
        "TDD",
        "CI/CD",
        "Scrum",
        "Web Development",
        "Mobile Application Development",
        "API Design",
        "Database Design"
      ]
    },
    {
      "name": "Technologie & Frameworks",
      "keywords": [
        "NodeJS",
        "Koa.js",
        "Express",
        "React",
        "React Native",
        "Redux",
        "D3",
        "GraphQL",
        "Websockets",
        "FFMPEG",
        "ImageMagick",
        "Apache Kafka",
        "Thrift"
      ]
    },
    {
      "name": "Data Stores",
      "keywords": ["PostgreSQL", "MySQL", "Redis", "DynamoDB", "Elasticsearch"]
    },
    {
      "name": "Continuous Integration",
      "keywords": ["Jenkins", "CircleCI", "Docker", "Nomad", "Git", "Fastlane"]
    },
    {
      "name": "Programming Languages",
      "keywords": ["Javascript", "Java", "Python", "Ruby", "HTML/CSS"]
    }
  ],
  "languages": [
    {
      "language": "Dutch",
      "fluency": "Native"
    },
    {
      "language": "English",
      "fluency": "Good"
    },
    {
      "language": "French",
      "fluency": "Moderate"
    }
  ],
  "interests": [
    {
      "name": "Music",
      "keywords": ["Guitar", "Piano", "Producing"]
    },
    {
      "name": "Sports",
      "keywords": ["Cycling", "Running", "Snowboarding", "Soccer"]
    },
    {
      "name": "Fun",
      "keywords": ["Live Music", "Ted Talks", "Movies"]
    }
  ],
  "references": [
    {
      "name": "Patrick Debois",
      "reference": "Ilja is the canonical example of \"Mens sana in corpore sano\". He gracefully lived through the rough times of an early startup: designing scalable architecture, developing it and ... also running it. Over the years I've seen him evolve to a professional cloud native with a great hunger for new things but with enough pragmatism to deliver your product without the worries. Allrounder skilled in AWS, Mobile, Modern Web and data algorithms, I can only recommend him and envy you when you hire him."
    },
    {
      "name": "Wouter Smet",
      "reference": "I've had the pleasure of studying for my M. Sc. in physics together with Ilja, including many group assignments, and having his sharp mind and inspiring creativity around consistently made it more pleasant to Get Things Done"
    }
  ]
}
